/* In browser window title */
"Get a donation key!" = "Spendenschlüssel fehlt!";

/* The full name of the supporter */
"Registered to {0}" = "Registriert auf {0}";

/* Cyberduck is open source software */
"Thanks for your support! Your contribution helps to further advance development to make Cyberduck even better." = "Vielen Dank fuer die Unterstützung! Ihr Beitrag wird die weitere Entwicklung vorantreiben um Cyberduck noch besser zu machen.";

/* Copy of donation key */
"Your donation key has been copied to the Application Support folder." = "Der Spendenschlüssel wurde kopiert.";

/* Validation failed */
"Not a valid donation key" = "Kein gültiger Spendenschlüssel";

"This donation key does not appear to be valid." = "Der Spendenschlüssel ist nicht gültig oder beschädigt.";

/* Thank you */
"Continue" = "Weiter";
/* Validation failed */
"Not a valid donation key" = "Kein gültiger Spendenschlüssel";

"This donation key does not appear to be valid." = "Der Spendenschlüssel ist nicht gültig oder beschädigt.";

/* Thank you */
"Continue" = "Weiter";